src/СРМ/src/Catalogs/КомментарииЗадач/КомментарииЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КомментарииЗадач</name>
  <basedOn>Document.Задача</basedOn>
  <attributes>
    <name>Задача</name>
    <type>
      <types>DocumentRef.Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Редактор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ПредметВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>Контакт</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправитьСообщениеКонтакту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщенияHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиКопий</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/СРМ/src/Catalogs/КомментарииЗадач/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	РВ_РедакторWysiwygHTML.ВставитьПолеРедактированияТекстаНаФорму(ЭтаФорма, Элементы.ГруппаТекстСообщения,"Объект.ТекстСообщения");
	РВ_РедакторWysiwygHTML.ПрочитатьПрисоединенныеФайлы(ЭтаФорма, Объект.Задача,"Объект.ТекстСообщения");
	УстановитьТекстПоляИстория();
	
	СформироватьПредставлениеКонтакта();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Наименование="Комментарий "+Объект.Автор+" от "+Объект.ДатаСоздания;
	
	РВ_РедакторWysiwygHTMLКлиент.УстановитьЗначениеПоляРедактированияВРеквизит(ЭтаФорма,"Объект.ТекстСообщения")
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ДобавленКомментарийКЗадаче",Объект.Задача,Объект.Ссылка);
	
	ПутьКДаннымБезЛишнего=РВ_РедакторWysiwygHTMLКлиентСервер.ПолучитьПутьКДаннымБезЛишнего("Объект.ТекстСообщения");
	УправлениеЗадачамиКлиент.ОбновитьИсториюЗадачи(Объект.Задача,Элементы.ИсторияЗадачи,ЭтотОбъект,РВ_РедакторWysiwygHTMLКлиентСервер.ДанныеПрисоединенныхФайлов(ЭтаФорма,ПутьКДаннымБезЛишнего));
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	РВ_РедакторWysiwygHTML.ЗаписатьНовыеПрисоединенныеФайлы(ЭтаФорма, ТекущийОбъект.Задача,"Объект.ТекстСообщения",ТекущийОбъект.Ссылка);	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РВ_РедакторWysiwygHTML.УдалитьНовыеПрисоединенныеФайлыСФормыПослеЗаписи(ЭтаФорма,"Объект.ТекстСообщения");	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия="ИзменилисьДопАдресаДляЭлектроннойПочты" 
		И Параметр=Объект.Ссылка Тогда
		УправлениеЗадачамиКлиентСервер.ОбновитьНадписьКоличестваДополнительныхПолучателейСообщений(Объект,Элементы.ЭлектроннаяПочтаКонтактаОбращенияКопии);
		Модифицированность=Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИсторияЗадачиДокументСформирован(Элемент)
	ПутьКДаннымБезЛишнего=РВ_РедакторWysiwygHTMLКлиентСервер.ПолучитьПутьКДаннымБезЛишнего("Объект.ТекстСообщения");
	УправлениеЗадачамиКлиент.ОбновитьИсториюЗадачи(Объект.Задача,Элементы.ИсторияЗадачи,ЭтотОбъект,РВ_РедакторWysiwygHTMLКлиентСервер.ДанныеПрисоединенныхФайлов(ЭтаФорма,ПутьКДаннымБезЛишнего));
КонецПроцедуры

&НаКлиенте
Процедура ЭлектроннаяПочтаКонтактаОбращенияКопииНажатие(Элемент)
	УправлениеЗадачамиКлиент.РедактироватьКопииПолучателейСобытияЗадачи(Объект,Неопределено);
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ПодключаемыеКоманды

#Область РВ_РедакторWysiwygHTML
//@skip-warning
&НаКлиенте
Процедура РВ_РедакторWysiwyg_Подключаемый_ДокументСформированПоляРедактированияКомментария(Элемент)
	РВ_РедакторWysiwygHTMLКлиент.ДокументСформированПоляРедактированияКомментария(ЭтаФорма, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура РВ_РедакторWysiwyg_Подключаемый_СобытиеПолеРедактированияКомментария(Событие) Экспорт
	РВ_РедакторWysiwygHTMLКлиент.СобытиеПолеРедактированияКомментария(ЭтаФорма, Событие);
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура РВ_РедакторWysiwyg_Подключаемый_ОткрытьПрисоединенныйФайл(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
//	РМ_MarkdownКлиент.ОткрытьПрисоединенныйФайл(ЭтаФорма,Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура РВ_РедакторWysiwyg_Подключаемый_ПриДобавленииПрисоединенногоФайла(ИмяФайла, ИдентификаторФайла, ПутьКДаннымБезЛишнего) Экспорт
	РВ_РедакторWysiwyg_Подключаемый_ПриДобавленииПрисоединенногоФайлаНаСервере(ИмяФайла, ИдентификаторФайла, ПутьКДаннымБезЛишнего);
КонецПроцедуры

&НаСервере
Процедура РВ_РедакторWysiwyg_Подключаемый_ПриДобавленииПрисоединенногоФайлаНаСервере(ИмяФайла, ИдентификаторФайла,
	ПутьКДаннымБезЛишнего) Экспорт
	РВ_РедакторWysiwygHTML.ВывестиЭлементыПрисоединенногоФайлаНаФорму(ЭтотОбъект, ИмяФайла, ИдентификаторФайла,
		ПутьКДаннымБезЛишнего);
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура РВ_РедакторWysiwyg_Подключаемый_УдалитьНовыйПрисоединенныйФайл(Команда)
	РВ_РедакторWysiwygHTMLКлиент.УдалитьНовыйПрисоединенныйФайл(ЭтаФорма, Команда);
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура РВ_РедакторWysiwyg_Подключаемый_ОткрытьНовыйПрисоединенныйФайл(Команда)
	РВ_РедакторWysiwygHTMLКлиент.ОткрытьПрисоединенныйФайл(ЭтаФорма, Команда);
КонецПроцедуры



#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьТекстПоляИстория()
	ИсторияЗадачи=УправлениеЗадачамиПовтИсп.СформироватьТекстHTMLДляПредставленияИсторииЗадачи();
КонецПроцедуры

&НаСервере
Процедура СформироватьПредставлениеКонтакта()
	АдресЭлектроннойПочтыКонтактаОбращения=УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.Контакт,Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица,,Истина);
	АдресЭлектроннойПочтыКонтактаОбращения=СокрЛП(АдресЭлектроннойПочтыКонтактаОбращения);
	
	ЕстьКонтакт=ЗначениеЗаполнено(Объект.Контакт) И ЗначениеЗаполнено(АдресЭлектроннойПочтыКонтактаОбращения);
	
	Объект.ОтправитьСообщениеКонтакту=ЕстьКонтакт;
	Элементы.ГруппаОтправкиСообщенияКонтакту.Видимость=ЕстьКонтакт;
	
	ПредставлениеКонтакта=ВзаимодействияКлиентСервер.ПолучитьПредставлениеАдресата("",АдресЭлектроннойПочтыКонтактаОбращения,Объект.Контакт);	
	
	УправлениеЗадачамиКлиентСервер.ОбновитьНадписьКоличестваДополнительныхПолучателейСообщений(Объект,Элементы.ЭлектроннаяПочтаКонтактаОбращенияКопии);
КонецПроцедуры

#КонецОбласти
